```

Terraform will perform the following actions:

  # data.archive_file.create_dist_pkg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "create_dist_pkg" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "build/function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "/Users/harshitagupta/sandbox/sgtm/terraform/lambda_dist_pkg/"
      + type                = "zip"
    }

  # aws_cloudwatch_event_rule.execute_sgtm_sync_users_event_rule will be destroyed
  # (because aws_cloudwatch_event_rule.execute_sgtm_sync_users_event_rule is not in configuration)
  - resource "aws_cloudwatch_event_rule" "execute_sgtm_sync_users_event_rule" {
      - arn                 = "arn:aws:events:us-east-1:553845104539:rule/execute_sgtm_sync_users" -> null
      - description         = "Execute Lambda function sgtm_sync_users on a cron-style schedule" -> null
      - event_bus_name      = "default" -> null
      - id                  = "execute_sgtm_sync_users" -> null
      - is_enabled          = true -> null
      - name                = "execute_sgtm_sync_users" -> null
      - schedule_expression = "rate(1 hour)" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
    }

  # aws_cloudwatch_event_target.execute_sgtm_sync_users_event_target will be destroyed
  # (because aws_cloudwatch_event_target.execute_sgtm_sync_users_event_target is not in configuration)
  - resource "aws_cloudwatch_event_target" "execute_sgtm_sync_users_event_target" {
      - arn            = "arn:aws:lambda:us-east-1:553845104539:function:sgtm_sync_users" -> null
      - event_bus_name = "default" -> null
      - id             = "execute_sgtm_sync_users-execute_sgtm_sync_users_event_target" -> null
      - rule           = "execute_sgtm_sync_users" -> null
      - target_id      = "execute_sgtm_sync_users_event_target" -> null
    }

  # aws_iam_policy.lambda-function-cloudwatch-policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda-function-cloudwatch-policy" {
        id        = "arn:aws:iam::553845104539:policy/terraform-20200604155419818100000003"
        name      = "terraform-20200604155419818100000003"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            "arn:aws:logs:us-east-1:*:log-group:/aws/lambda/sgtm:*",
                          - "arn:aws:logs:us-east-1:*:log-group:/aws/lambda/sgtm_sync_users:*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.sgtm will be updated in-place
  ~ resource "aws_lambda_function" "sgtm" {
        id                             = "sgtm"
      ~ last_modified                  = "2024-04-12T19:06:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "n287praMSzXhe7JqFjJ6r9W/cDgl2/DeeE6CuXEm7xE=" -> (known after apply)
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.sgtm_sync_users will be destroyed
  # (because aws_lambda_function.sgtm_sync_users is not in configuration)
  - resource "aws_lambda_function" "sgtm_sync_users" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:553845104539:function:sgtm_sync_users" -> null
      - function_name                  = "sgtm_sync_users" -> null
      - handler                        = "src.sync_users.handler.handler" -> null
      - id                             = "sgtm_sync_users" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:553845104539:function:sgtm_sync_users/invocations" -> null
      - last_modified                  = "2024-04-12T19:06:58.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:553845104539:function:sgtm_sync_users:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::553845104539:role/iam_for_lambda" -> null
      - runtime                        = "python3.9" -> null
      - s3_bucket                      = "asana-tools-sgtm-lambda-code" -> null
      - s3_key                         = "sgtm_bundle.zip" -> null
      - source_code_hash               = "n287praMSzXhe7JqFjJ6r9W/cDgl2/DeeE6CuXEm7xE=" -> null
      - source_code_size               = 23185316 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "API_KEYS_S3_BUCKET"     = "asana-tools-sgtm-api-keys"
              - "API_KEYS_S3_KEY"        = "sgtm-keys"
              - "ASANA_USERS_PROJECT_ID" = "64201726605125"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.lambda_permission_for_sgtm_sync_users_schedule_event will be destroyed
  # (because aws_lambda_permission.lambda_permission_for_sgtm_sync_users_schedule_event is not in configuration)
  - resource "aws_lambda_permission" "lambda_permission_for_sgtm_sync_users_schedule_event" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sgtm_sync_users" -> null
      - id            = "AllowSGTMSyncUsersInvoke" -> null
      - principal     = "events.amazonaws.com" -> null
      - source_arn    = "arn:aws:events:us-east-1:553845104539:rule/execute_sgtm_sync_users" -> null
      - statement_id  = "AllowSGTMSyncUsersInvoke" -> null
    }

  # aws_s3_bucket_object.lambda_code_bundle will be updated in-place
  ~ resource "aws_s3_bucket_object" "lambda_code_bundle" {
        id                     = "sgtm_bundle.zip"
      ~ source_hash            = "n287praMSzXhe7JqFjJ6r9W/cDgl2/DeeE6CuXEm7xE=" -> (known after apply)
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "2474918708404385654" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "src_sha1" = "ea2b605e7ae1dd1578e937cd9c0ee9a6a5cf473a" -> "9f04dacece916615522a55b8ccf513d6f1f470d9"
        }
    }

Plan: 1 to add, 3 to change, 5 to destroy.

```